<?xml version="1.0"?>
<net name="tokenizer" version="11">
	<layers>
		<layer id="0" name="Parameter_68418" type="Parameter" version="opset1">
			<data shape="?" element_type="string" />
			<output>
				<port id="0" precision="STRING" names="Parameter_68418">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_68517" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="2" name="Constant_68518" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="3" name="Constant_68519" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="8" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_68424" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="5" name="StringTensorUnpack_68419" type="StringTensorUnpack" version="extension">
			<data mode="begins_ends" />
			<input>
				<port id="0" precision="STRING">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="ShapeOf_68420" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_68421" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="8" name="Constant_68422" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="9" name="Gather_68423" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" />
			</output>
		</layer>
		<layer id="10" name="Constant_68425" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="11" name="Range_68426" type="Range" version="opset4">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_68427" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="13" name="Constant_68428" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="12" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="14" name="Add_68429" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" />
			</output>
		</layer>
		<layer id="15" name="Constant_68430" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="16" name="Range_68431" type="Range" version="opset4">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_68493" type="Const" version="opset1">
			<data element_type="u8" shape="455" offset="20" size="455" />
			<output>
				<port id="0" precision="U8">
					<dim>455</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="SpecialTokensSplit_68494" type="SpecialTokensSplit" version="extension">
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="U8">
					<dim>455</dim>
				</port>
			</input>
			<output>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="10" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="11" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="NormalizeUnicode_68495" type="NormalizeUnicode" version="extension">
			<data normalization_form="NFC" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="3" precision="BOOL">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="7" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_68497" type="Const" version="opset1">
			<data element_type="u8" shape="110" offset="475" size="110" />
			<output>
				<port id="0" precision="U8">
					<dim>110</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="RegexSplit_68498" type="RegexSplit" version="extension">
			<data behaviour="isolate" invert="false" max_splits="-1" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="BOOL">
					<dim>-1</dim>
				</port>
				<port id="6" precision="U8">
					<dim>110</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="10" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="11" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="12" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_68500" type="Const" version="opset1">
			<data element_type="u8" shape="1582941" offset="585" size="1582941" />
			<output>
				<port id="0" precision="U8">
					<dim>1582941</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StringTensorUnpack_68501" type="StringTensorUnpack" version="extension">
			<data mode="begins_ends" />
			<input>
				<port id="0" precision="U8">
					<dim>1582941</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_68506" type="Const" version="opset1">
			<data element_type="u8" shape="1096915" offset="1583526" size="1096915" />
			<output>
				<port id="0" precision="U8">
					<dim>1096915</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StringTensorUnpack_68507" type="StringTensorUnpack" version="extension">
			<data mode="begins_ends" />
			<input>
				<port id="0" precision="U8">
					<dim>1096915</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_68509" type="Const" version="opset1">
			<data element_type="u8" shape="1089910" offset="2680441" size="1089910" />
			<output>
				<port id="0" precision="U8">
					<dim>1089910</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StringTensorUnpack_68510" type="StringTensorUnpack" version="extension">
			<data mode="begins_ends" />
			<input>
				<port id="0" precision="U8">
					<dim>1089910</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_68503" type="Const" version="opset1">
			<data element_type="u8" shape="400" offset="3770351" size="400" />
			<output>
				<port id="0" precision="U8">
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StringTensorUnpack_68504" type="StringTensorUnpack" version="extension">
			<data mode="begins_ends" />
			<input>
				<port id="0" precision="U8">
					<dim>400</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_68511" type="Const" version="opset1">
			<data element_type="i32" shape="22" offset="3770751" size="88" />
			<output>
				<port id="0" precision="I32">
					<dim>22</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="BPETokenizer_68512" type="BPETokenizer" version="extension">
			<data unk_token="" fuse_unk="false" suffix_indicator="" end_suffix="" byte_fallback="false" cache_capacity="30328" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="10" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="11" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="12" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="13" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="14" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="15" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="16" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="17" precision="I32">
					<dim>22</dim>
				</port>
			</input>
			<output>
				<port id="18" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="19" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="20" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Subtract_68513" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_68514" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="3770839" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="34" name="Minimum_68515" type="Minimum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Subtract_68516" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_68520" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="3770843" size="8" />
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="CombineSegments_68521" type="CombineSegments" version="extension">
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="10" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="11" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="12" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Subtract_68522" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_68523" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="40" name="ReduceMax_68524" type="ReduceMax" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" />
			</output>
		</layer>
		<layer id="41" name="Constant_68525" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="3770851" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="42" name="RaggedToDense_68526" type="RaggedToDense" version="extension">
			<data pad_right="false" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32" />
				<port id="4" precision="I32" />
			</input>
			<output>
				<port id="5" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="6" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Convert_68527" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Convert_68527.0" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="RaggedToDense_68526.0" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Result_68530" type="Result" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
		</layer>
		<layer id="45" name="Result_68532" type="Result" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="5" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="37" to-port="0" />
		<edge from-layer="2" from-port="0" to-layer="37" to-port="1" />
		<edge from-layer="3" from-port="0" to-layer="37" to-port="2" />
		<edge from-layer="4" from-port="0" to-layer="11" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="6" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="18" to-port="2" />
		<edge from-layer="5" from-port="2" to-layer="18" to-port="3" />
		<edge from-layer="5" from-port="3" to-layer="18" to-port="4" />
		<edge from-layer="6" from-port="1" to-layer="9" to-port="0" />
		<edge from-layer="7" from-port="0" to-layer="9" to-port="1" />
		<edge from-layer="8" from-port="0" to-layer="9" to-port="2" />
		<edge from-layer="9" from-port="3" to-layer="11" to-port="1" />
		<edge from-layer="9" from-port="3" to-layer="14" to-port="0" />
		<edge from-layer="10" from-port="0" to-layer="11" to-port="2" />
		<edge from-layer="11" from-port="3" to-layer="18" to-port="0" />
		<edge from-layer="12" from-port="0" to-layer="16" to-port="0" />
		<edge from-layer="13" from-port="0" to-layer="14" to-port="1" />
		<edge from-layer="14" from-port="2" to-layer="16" to-port="1" />
		<edge from-layer="15" from-port="0" to-layer="16" to-port="2" />
		<edge from-layer="16" from-port="3" to-layer="18" to-port="1" />
		<edge from-layer="17" from-port="0" to-layer="18" to-port="5" />
		<edge from-layer="18" from-port="11" to-layer="19" to-port="3" />
		<edge from-layer="18" from-port="6" to-layer="21" to-port="0" />
		<edge from-layer="18" from-port="7" to-layer="21" to-port="1" />
		<edge from-layer="18" from-port="8" to-layer="19" to-port="0" />
		<edge from-layer="18" from-port="9" to-layer="19" to-port="1" />
		<edge from-layer="18" from-port="10" to-layer="19" to-port="2" />
		<edge from-layer="19" from-port="7" to-layer="21" to-port="5" />
		<edge from-layer="19" from-port="4" to-layer="21" to-port="2" />
		<edge from-layer="19" from-port="5" to-layer="21" to-port="3" />
		<edge from-layer="19" from-port="6" to-layer="21" to-port="4" />
		<edge from-layer="20" from-port="0" to-layer="21" to-port="6" />
		<edge from-layer="21" from-port="7" to-layer="31" to-port="0" />
		<edge from-layer="21" from-port="8" to-layer="31" to-port="1" />
		<edge from-layer="21" from-port="9" to-layer="31" to-port="2" />
		<edge from-layer="21" from-port="10" to-layer="31" to-port="3" />
		<edge from-layer="21" from-port="11" to-layer="31" to-port="4" />
		<edge from-layer="22" from-port="0" to-layer="23" to-port="0" />
		<edge from-layer="23" from-port="1" to-layer="31" to-port="5" />
		<edge from-layer="23" from-port="2" to-layer="31" to-port="6" />
		<edge from-layer="23" from-port="3" to-layer="31" to-port="7" />
		<edge from-layer="24" from-port="0" to-layer="25" to-port="0" />
		<edge from-layer="25" from-port="2" to-layer="31" to-port="9" />
		<edge from-layer="25" from-port="3" to-layer="31" to-port="10" />
		<edge from-layer="25" from-port="1" to-layer="31" to-port="8" />
		<edge from-layer="26" from-port="0" to-layer="27" to-port="0" />
		<edge from-layer="27" from-port="1" to-layer="31" to-port="11" />
		<edge from-layer="27" from-port="2" to-layer="31" to-port="12" />
		<edge from-layer="27" from-port="3" to-layer="31" to-port="13" />
		<edge from-layer="28" from-port="0" to-layer="29" to-port="0" />
		<edge from-layer="29" from-port="1" to-layer="31" to-port="14" />
		<edge from-layer="29" from-port="2" to-layer="31" to-port="15" />
		<edge from-layer="29" from-port="3" to-layer="31" to-port="16" />
		<edge from-layer="30" from-port="0" to-layer="31" to-port="17" />
		<edge from-layer="31" from-port="19" to-layer="32" to-port="0" />
		<edge from-layer="31" from-port="18" to-layer="32" to-port="1" />
		<edge from-layer="31" from-port="19" to-layer="37" to-port="4" />
		<edge from-layer="31" from-port="20" to-layer="37" to-port="5" />
		<edge from-layer="31" from-port="19" to-layer="35" to-port="0" />
		<edge from-layer="32" from-port="2" to-layer="34" to-port="0" />
		<edge from-layer="33" from-port="0" to-layer="34" to-port="1" />
		<edge from-layer="34" from-port="2" to-layer="35" to-port="1" />
		<edge from-layer="35" from-port="2" to-layer="37" to-port="3" />
		<edge from-layer="36" from-port="0" to-layer="37" to-port="6" />
		<edge from-layer="37" from-port="8" to-layer="38" to-port="0" />
		<edge from-layer="37" from-port="7" to-layer="38" to-port="1" />
		<edge from-layer="37" from-port="7" to-layer="42" to-port="0" />
		<edge from-layer="37" from-port="8" to-layer="42" to-port="1" />
		<edge from-layer="37" from-port="9" to-layer="42" to-port="2" />
		<edge from-layer="38" from-port="2" to-layer="40" to-port="0" />
		<edge from-layer="39" from-port="0" to-layer="40" to-port="1" />
		<edge from-layer="40" from-port="2" to-layer="42" to-port="3" />
		<edge from-layer="41" from-port="0" to-layer="42" to-port="4" />
		<edge from-layer="42" from-port="6" to-layer="43" to-port="0" />
		<edge from-layer="42" from-port="5" to-layer="46" to-port="0" />
		<edge from-layer="43" from-port="1" to-layer="44" to-port="0" />
		<edge from-layer="44" from-port="1" to-layer="45" to-port="0" />
		<edge from-layer="46" from-port="1" to-layer="47" to-port="0" />
	</edges>
	<rt_info>
		<add_attention_mask value="True" />
		<add_prefix_space />
		<add_special_tokens value="True" />
		<bos_token_id value="151646" />
		<chat_template value="{% if not add_generation_prompt is defined %}{% set add_generation_prompt = false %}{% endif %}{% set ns = namespace(is_first=false, is_tool=false, is_output_first=true, system_prompt='') %}{%- for message in messages %}{%- if message['role'] == 'system' %}{% set ns.system_prompt = message['content'] %}{%- endif %}{%- endfor %}{{bos_token}}{{ns.system_prompt}}{%- for message in messages %}{%- if message['role'] == 'user' %}{%- set ns.is_tool = false -%}{{'&lt;｜User｜>' + message['content']}}{%- endif %}{%- if message['role'] == 'assistant' and message['content'] is none %}{%- set ns.is_tool = false -%}{%- for tool in message['tool_calls']%}{%- if not ns.is_first %}{{'&lt;｜Assistant｜>&lt;｜tool▁calls▁begin｜>&lt;｜tool▁call▁begin｜>' + tool['type'] + '&lt;｜tool▁sep｜>' + tool['function']['name'] + '\n' + '```json' + '\n' + tool['function']['arguments'] + '\n' + '```' + '&lt;｜tool▁call▁end｜>'}}{%- set ns.is_first = true -%}{%- else %}{{'\n' + '&lt;｜tool▁call▁begin｜>' + tool['type'] + '&lt;｜tool▁sep｜>' + tool['function']['name'] + '\n' + '```json' + '\n' + tool['function']['arguments'] + '\n' + '```' + '&lt;｜tool▁call▁end｜>'}}{{'&lt;｜tool▁calls▁end｜>&lt;｜end▁of▁sentence｜>'}}{%- endif %}{%- endfor %}{%- endif %}{%- if message['role'] == 'assistant' and message['content'] is not none %}{%- if ns.is_tool %}{{'&lt;｜tool▁outputs▁end｜>' + message['content'] + '&lt;｜end▁of▁sentence｜>'}}{%- set ns.is_tool = false -%}{%- else %}{% set content = message['content'] %}{% if '&lt;/think>' in content %}{% set content = content.split('&lt;/think>')[-1] %}{% endif %}{{'&lt;｜Assistant｜>' + content + '&lt;｜end▁of▁sentence｜>'}}{%- endif %}{%- endif %}{%- if message['role'] == 'tool' %}{%- set ns.is_tool = true -%}{%- if ns.is_output_first %}{{'&lt;｜tool▁outputs▁begin｜>&lt;｜tool▁output▁begin｜>' + message['content'] + '&lt;｜tool▁output▁end｜>'}}{%- set ns.is_output_first = false %}{%- else %}{{'\n&lt;｜tool▁output▁begin｜>' + message['content'] + '&lt;｜tool▁output▁end｜>'}}{%- endif %}{%- endif %}{%- endfor -%}{% if ns.is_tool %}{{'&lt;｜tool▁outputs▁end｜>'}}{% endif %}{% if add_generation_prompt and not ns.is_tool %}{{'&lt;｜Assistant｜>&lt;think>\n'}}{% endif %}" />
		<clean_up_tokenization_spaces />
		<detokenizer_input_type value="i64" />
		<eos_token_id value="151643" />
		<handle_special_tokens_with_re />
		<number_of_inputs value="1" />
		<openvino_tokenizers_version value="2025.0.0.0" />
		<openvino_version value="2025.0.0" />
		<original_tokenizer_class value="&lt;class 'transformers.models.llama.tokenization_llama_fast.LlamaTokenizerFast'>" />
		<pad_token_id value="151643" />
		<sentencepiece_version value="0.2.0" />
		<simplified_chat_template value="{% for message in messages %}{% if loop.first %}{{ '&lt;｜begin▁of▁sentence｜>' }}{% endif %}{% if message['role'] == 'system' and message['content'] %}{{ message['content'] }}{% elif message['role'] == 'user' %}{{  '&lt;｜User｜>' +  message['content'] }}{% elif message['role'] == 'assistant' %}{{ '&lt;｜Assistant｜>' +  message['content'] + '&lt;｜end▁of▁sentence｜>' }}{% endif %}{% if loop.last and add_generation_prompt %}{{ '&lt;｜Assistant｜>' }}{% endif %}{% endfor %}" />
		<skip_special_tokens value="True" />
		<streaming_detokenizer value="False" />
		<tiktoken_version value="0.8.0" />
		<tokenizer_output_type value="i64" />
		<tokenizers_version value="0.20.3" />
		<transformers_version value="4.46.2" />
		<use_max_padding value="False" />
		<use_sentencepiece_backend value="False" />
		<utf8_replace_mode value="replace" />
		<with_detokenizer value="True" />
	</rt_info>
</net>
